//特殊词条
var npcdata =
{
    //人类
    "[安度因]": "蒂芬与瓦里安·乌瑞恩之子，安度因·莱恩·乌瑞恩是暴风城的王位继承人。",
    //暗夜精灵
    //矮人
    //侏儒
    //德莱尼
    //狼人
    //亡灵
    //巨魔
    //血精灵
    //兽人
    "[格罗玛什•地狱咆哮]": "德拉诺七雄之一,加尔鲁什•地狱咆哮的父亲.以后的'斧王'.详情请参见-德拉诺之王页面",
    "[黑手]":"德拉诺七雄之一,全身穿上了容颜铸造的铠甲,在钢铁部落兵工厂,详情请参见-德拉诺之王页面",
    "[耐奥祖]": "德拉诺七雄之一,也是以后的巫妖王.详情请参见-德拉诺之王页面",
    "[古尔丹]":"德拉诺七雄之一,暗影议会的头目,最早投靠燃烧军团的兽人,肤色为绿色,详情请参见-德拉诺之王页面",
    "[基尔罗格·死眼]": "德拉诺七雄之一,血窟兽人领袖,通过刺瞎眼睛来知晓自己的命运,到目前为止,已经喝下恶魔血液,详情请参见-德拉诺之王页面"
    //地精,
    //牛头人
    //熊猫人
    //龙类
    //恶魔
    //龙类
    //野兽
    //玛戈隆-戈隆
    //食人魔
    //畸变体
    //机械
  //----------------------------------组织----------------------------------


  //--------------------------------事件------------------------------------

  //--------------------------------物品------------------------------------


}
$(function () {
    $("span[data-tooltip]").bind('mouseover', function () {
        $(this).attr("data-tooltip", AddTitle($(this)));
    });
});
function AddTitle(obj) {
    var npcname = $(obj).html().toString().trim();
    return npcdata[npcname] === undefined ? "此词条暂时无说明!" : npcdata[npcname];
}