//特殊词条
var npcdata =
{
    //人类
    "[安度因]": "蒂芬与瓦里安·乌瑞恩之子，安度因·莱恩·乌瑞恩是暴风城的王位继承人。",
    //暗夜精灵
    //矮人
    //侏儒
    //德莱尼
    //狼人
    //亡灵
    //巨魔
    //血精灵
    //兽人
    "[格罗玛什•地狱咆哮]": "德拉诺七雄之一,详情请参见-德拉诺之王页面",
    "[黑手]":"德拉诺七雄之一,详情请参见-德拉诺之王页面",
    "[耐奥祖]": "德拉诺七雄之一,详情请参见-德拉诺之王页面",
    "[古尔丹]": "德拉诺七雄之一,详情请参见-德拉诺之王页面",
    "[基尔罗格·死眼]": "德拉诺七雄之一,详情请参见-德拉诺之王页面",
    "[杜隆坦]":"德拉诺七雄之一,详情请参见-德拉诺之王页面",
    //地精,
    //牛头人
    //熊猫人
    //龙类
    //恶魔
    "[玛诺洛斯]": "深渊领主一族,玛诺洛斯是一个充满毁灭欲望的巨型恶魔，它对仇恨与杀戮有着强烈的兴趣.阿克蒙德手下得利战将.",
    //龙类
    //野兽
    //玛戈隆-戈隆
    "[戈隆]":"德拉诺本土的一种生物,独眼,十分强壮.代表怪物:屠龙者格鲁尔"
    //食人魔
    //畸变体
    //机械
  //----------------------------------组织----------------------------------


  //--------------------------------事件------------------------------------

  //--------------------------------物品------------------------------------


}
$(function () {
    $("span[data-tooltip]").bind('mouseover', function () {
        $(this).attr("data-tooltip", AddTitle($(this)));
    });
});
function AddTitle(obj) {
    var npcname = $(obj).html().toString().trim();
    return npcdata[npcname] === undefined ? "此词条暂时无说明!" : npcdata[npcname];
}